
// TODO 营业时间弹窗出现时，点击空白处弹窗不能消失

// TODO 手机 + 验证码注册 注册成功 --> 给自己的品牌命个名吧
// TODO 美化界面（金属质感）
// TODO 改一下整个APP 的配色 

// TODO 修复滑动块的蓝边
// TODO 加上路由动画
// TODO 数据可视化
// TODO 修改字体
// TODO 完善定位

// TODO 用户地域分布[饼图]十个 1
// TODO 关键词词云
// TODO 柱状图一周内的用户活跃度
// TODO 关联词
// TODO 用户1 || 口碑(折线图 + 词云) ||
// TODO 相关搜索词(词云) ^^ 用户地域分布[饼图]十个
// TODO 内部权限
// TODO poi 修改日志
// TODO 埋点
// TODO package 低 | 中 | 高 | 海外
// TODO 优化

// TODO 写测试（jest vuetest）
// TODO 营业时间的格式解析

// 有一个添加营业时间的按钮, 点击该按钮, 增加一个 TIME picker, 用于选择营业时间
// time picker 上有一个删除按钮, 点击则删除该营业时段
// time picker 之间相互关联, 不能同时选择同一天
//  listing 上线
//  poi --> listing
//  PC bug
//  =注意= 该操作将删除此门店信息，并影响已上线的平台信息展示。如果此门店关闭不再营业,请通过“编辑”-修改“营业状态”来完成修改。
//  图标
//  定位的 LOGO
//  区分区分开发环境还是生产环境
//  singleListing 
//  完善营业时间, 营业时间选择的限制


